bash/arrays.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgde7b329">Arrays</a></li>
<li><a href="#org6b6dc28">Semi advanced concepts ahead</a>
<ul>
<li><a href="#org0f3165c">Heres how to print an array</a></li>
<li><a href="#org5d5922c">Sparse arrays</a></li>
<li><a href="#org51c29fc">Associative arrays</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgde7b329" class="outline-2">
<h2 id="orgde7b329">Arrays</h2>
<div class="outline-text-2" id="text-orgde7b329">
<p>
Heres how to make an array
</p>

<div class="org-src-container">
<pre class="src src-shell">

  <span style="font-weight: bold; font-style: italic;">classes</span>=(<span style="font-style: italic;">"Math"</span> <span style="font-style: italic;">"English"</span> <span style="font-style: italic;">"History"</span> <span style="font-style: italic;">"$JAVAHOME"</span>)

declare -p classes

</pre>
</div>

<p>
Here's how to assign the array to multiple indices.
</p>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">This is a sparse array</span>

        <span style="font-weight: bold; font-style: italic;">names</span>=([0]=<span style="font-style: italic;">"Bob"</span> [1]=<span style="font-style: italic;">"Peter"</span> [20]=<span style="font-style: italic;">"$USER"</span> [21]=<span style="font-style: italic;">"Big Bad John"</span>)

      <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">or you could do this</span>

    names[0]=<span style="font-style: italic;">"Bob"</span>

  declare -p names

</pre>
</div>

<p>
You can file an array with files with teh follwing
</p>

<div class="org-src-container">
<pre class="src src-shell">
    <span style="font-weight: bold; font-style: italic;">orgfiles</span>=(~/*.org)

declare -p orgfiles



</pre>
</div>
</div>
</div>

<div id="outline-container-org6b6dc28" class="outline-2">
<h2 id="org6b6dc28">Semi advanced concepts ahead</h2>
<div class="outline-text-2" id="text-org6b6dc28">
<p>
Bash is written in c in c an array ends with a null byte.  Bash inherits this behavior.  Data streams can contain NUL bytes which are output from a data stream.  FIle name and most human readlable thinsg can not contain NUL bytes.
</p>

<div class="org-src-container">
<pre class="src src-shell">

<span style="font-weight: bold; font-style: italic;">files</span>=()
<span style="font-weight: bold;">while </span><span style="font-weight: bold;">read</span> -r -d <span style="font-style: italic;">''</span>; <span style="font-weight: bold;">do</span>
    files+=(<span style="font-style: italic;">"$REPLY"</span>)
<span style="font-weight: bold;">done</span> &lt; &lt;(find /foo -print0)

</pre>
</div>

<p>
Above is the best way to read a commands output.  Heres why
</p>

<ul class="org-ul">
<li>First line is an empty array called files.</li>
<li>the while loop uses -d where after the -d that's the delimiter, in this case it interprets the empty string as a NUL byte (\0).  This means we nread up to a null byte.  The -r makes the program not tead '\' specially.</li>
<li>Once were at a null byte what we read is stored in reply and we append it to the files array. thats done with the +=() syntax.</li>
</ul>
</div>

<div id="outline-container-org0f3165c" class="outline-3">
<h3 id="org0f3165c">Heres how to print an array</h3>
<div class="outline-text-3" id="text-org0f3165c">
<p>
declare -a declares an numeric array
</p>

<div class="org-src-container">
<pre class="src src-shell">

    declare -a <span style="font-weight: bold; font-style: italic;">myfiles</span>=<span style="font-style: italic;">'([0]="/home/wooledg/.bashrc" [1]="billing codes.xlsx" [2]="hello.c")'</span>
declare -p myfiles

  myFiles[3]=<span style="font-style: italic;">'"Hi"'</span>

  <span style="font-weight: bold;">echo</span> ${<span style="font-weight: bold; font-style: italic;">myfiles</span>[2]}

<span style="font-weight: bold;">echo</span> ${<span style="font-weight: bold; font-style: italic;">myfiles</span>[@]}

</pre>
</div>


<p>
The @ Sybil expands the array and splits theme each up into one word.  Very useful.
</p>

<div class="org-src-container">
<pre class="src src-shell">
  mkdir backups &amp;&amp; <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"We made a backup directory"</span>

<span style="font-weight: bold;">for</span> file<span style="font-weight: bold;"> in</span> <span style="font-style: italic;">"${myfiles[@]}"</span>; <span style="font-weight: bold;">do</span>
    cp file ./backups/
  <span style="font-weight: bold;">done</span>


</pre>
</div>

<p>
It doesnt have to be in a for loop
</p>

<div class="org-src-container">
<pre class="src src-shell">
  <span style="font-weight: bold; font-style: italic;">myBackups</span>=(<span style="font-style: italic;">"Projects.zip"</span> <span style="font-style: italic;">"Labs.zip"</span> <span style="font-style: italic;">"Wowzers.zip"</span>)

cp <span style="font-style: italic;">"${myBackups[@]}"</span> ~/delete/

</pre>
</div>
<p>
To convert an array to a single string one can use this Syntax.
</p>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold; font-style: italic;">names</span>=(<span style="font-style: italic;">"Bob"</span> <span style="font-style: italic;">"Peter"</span> <span style="font-style: italic;">"$USER"</span> <span style="font-style: italic;">"Big Bad John"</span>)
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Today's contestants are: ${names[*]}"</span>


</pre>
</div>
<p>
You can use IFS with bash (Internal field separator).
</p>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold; font-style: italic;">names</span>=(<span style="font-style: italic;">"Bob"</span> <span style="font-style: italic;">"Peter"</span> <span style="font-style: italic;">"$USER"</span> <span style="font-style: italic;">"Big Bad John"</span>)
( <span style="font-weight: bold; font-style: italic;">IFS</span>=,; <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Today's contestants are: ${names[*]}"</span> )


</pre>
</div>

<p>
The parentheses create subshell.  This is useful for not changing IFS in the main shell just in the parens.
</p>

<p>
To get the number of elemnts in an array use this trick.
</p>

<div class="org-src-container">
<pre class="src src-shell">
  <span style="font-weight: bold; font-style: italic;">array</span>=(a b c d e f)
<span style="font-weight: bold;">echo</span> ${#<span style="font-weight: bold; font-style: italic;">array</span>[@]}

</pre>
</div>
<p>
To exapnd into a list of indicies we sue this syntax.
</p>

<div class="org-src-container">
<pre class="src src-shell">
  <span style="font-weight: bold; font-style: italic;">array</span>=(wow my name is buddy whats yours)

<span style="font-weight: bold;">echo</span> ${<span style="font-weight: bold; font-style: italic;">!</span>array[@]}

</pre>
</div>
<p>
The [..] creates an artihmatic context which means you go do math without (())
</p>

<div class="org-src-container">
<pre class="src src-shell">

  <span style="font-weight: bold; font-style: italic;">a</span>=(a b c d e f g h i j k)
<span style="font-weight: bold;">for</span> ((<span style="font-weight: bold; font-style: italic;">i</span>=0; i&lt;${#<span style="font-weight: bold; font-style: italic;">a</span>[@]}; i+=2)); <span style="font-weight: bold;">do</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${a[i]} and ${a[i+1]}"</span>
<span style="font-weight: bold;">done</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org5d5922c" class="outline-3">
<h3 id="org5d5922c">Sparse arrays</h3>
<div class="outline-text-3" id="text-org5d5922c">
<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold; font-style: italic;">nums</span>=(zero one two three four)
nums[70]=<span style="font-style: italic;">"seventy"</span>
<span style="font-weight: bold;">unset</span> <span style="font-style: italic;">'nums[3]'</span>
declare -p nums
declare -a <span style="font-weight: bold; font-style: italic;">nums</span>=<span style="font-style: italic;">'([0]="zero" [1]="one" [2]="two" [4]="four" [70]="seventy")'</span>

</pre>
</div>
<p>
You can unset values and have indicies way out in left field and still be a valid array.  In unset we quote the 'nums[3]' so bash doesn't see it as a file glob.
</p>

<p>
Also using ${arrayname[@]} will remove all gaps in the array
</p>
<div class="org-src-container">
<pre class="src src-shell">
    <span style="font-weight: bold; font-style: italic;">letters</span>=(a b c d e [70]=<span style="font-style: italic;">"f"</span> g h i j k l)

  declare -p letters

<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${letters[@]}"</span>

  declare -p letters

</pre>
</div>
</div>
</div>

<div id="outline-container-org51c29fc" class="outline-3">
<h3 id="org51c29fc">Associative arrays</h3>
<div class="outline-text-3" id="text-org51c29fc">
<p>
These allow the indices of an array to be something other than indices.
</p>



<div class="org-src-container">
<pre class="src src-shell" id="org94b54f7">
declare -A fullNames
<span style="font-weight: bold; font-style: italic;">fullNames</span>=( [<span style="font-style: italic;">"lhunath"</span>]=<span style="font-style: italic;">"Maarten Billemont"</span> [<span style="font-style: italic;">"greycat"</span>]=<span style="font-style: italic;">"Greg Wooledge"</span> [<span style="font-style: italic;">'malcolm2'</span>]=<span style="font-style: italic;">"Malcolm Kahora"</span> )
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Current user is: $USER.  Full name: ${fullNames[$USER]}."</span>


</pre>
</div>

<pre class="example">
Current user is: malcolm2.  Full name: Malcolm Kahora.

</pre>

<p>
We can also print easily
</p>

<div class="org-src-container">
<pre class="src src-shell">
   declare -A dict
  dict[astro]=<span style="font-style: italic;">"Foo Bar"</span>
  declare -p dict

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Below is the same as above</span>
  declare -A <span style="font-weight: bold; font-style: italic;">dict</span>=<span style="font-style: italic;">'([astro]="Foo Bar")'</span>

</pre>
</div>

<p>
Here's how you iterate over an associative array.
</p>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold;">for</span> user<span style="font-weight: bold;"> in</span> <span style="font-style: italic;">"${!fullNames[@]}"</span>
<span style="font-weight: bold;">do </span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"User: $user, full name: ${fullNames[$user]}."</span>; <span style="font-weight: bold;">done</span>



</pre>
</div>

<p>
Some caveats of the above program are as follows.  The order of keys we get back form "${!array[@]}"  is unpredictable.  Associative arrays are not well suited for arrays that need to be in a particular order. Same with "{array[@]}"
</p>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold; font-style: italic;">indexedArray</span>=( <span style="font-style: italic;">"one"</span> <span style="font-style: italic;">"two"</span> )
declare -A <span style="font-weight: bold; font-style: italic;">associativeArray</span>=( [<span style="font-style: italic;">"foo"</span>]=<span style="font-style: italic;">"bar"</span> [<span style="font-style: italic;">"alpha"</span>]=<span style="font-style: italic;">"omega"</span> )
<span style="font-weight: bold; font-style: italic;">index</span>=0 <span style="font-weight: bold; font-style: italic;">key</span>=<span style="font-style: italic;">"foo"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${indexedArray[$index]}"</span>
one
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${indexedArray[index]}"</span>
one
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${indexedArray[index + 1]}"</span>
two
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${associativeArray[$key]}"</span>
bar
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${associativeArray[key]}"</span>

<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${associativeArray[key + 1]}"</span>

</pre>
</div>
<p>
Everything fails except the $key
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
